---
kind: property
id: P:Autodesk.Revit.DB.PaperSource.Name
source: html/23391a29-f004-966d-a4a1-d8b57110fb2c.htm
---
# Autodesk.Revit.DB.PaperSource.Name Property

Retrieve the paper source name of current project.

## Syntax (C#)
```csharp
public string Name { get; }
```